---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarBarType
source: html/01ac7bfb-d646-b0e7-cf7b-382a67905642.htm
---
# RebarBarType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.